
## :white_check_mark: Apply Succeeded (shared-snowplow-consumer-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/77069)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.aws_region.shared-snowplow-consumer-app_application_pocket_vpc_current_region_9631710E: Reading...
aws_acm_certificate.shared-snowplow-consumer-app_application_alb_certificate_7A543611: Refreshing state... [id=arn:aws:acm:us-east-1:410318598490:certificate/d16c753d-3fb4-4b69-b940-f68b39f15869]
data.aws_kms_alias.shared-snowplow-consumer-app_application_pocket_vpc_secrets_manager_key_901EECFD: Reading...
data.aws_ssm_parameter.shared-snowplow-consumer-app_application_pocket_vpc_private_subnets_3023DDDD: Reading...
aws_cloudwatch_log_group.shared-snowplow-consumer-app_aws-otel-collector-log-group_408C8F4B: Refreshing state... [id=/Backend/SharedSnowplowConsumer-Dev/ecs/aws-otel-collector]
aws_ecs_cluster.shared-snowplow-consumer-app_application_ecs_cluster_E189522B: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:cluster/SharedSnowplowConsumer-Dev]
data.aws_sns_topic.backend_notifications: Reading...
data.aws_region.shared-snowplow-consumer-app_application_pocket_vpc_current_region_9631710E: Read complete after 0s [id=us-east-1]
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:SharedSnowplowConsumer-Dev-Infrastructure-Alarm-Non-Critical]
aws_route53_zone.shared-snowplow-consumer-app_application_base_dns_subhosted_zone_F2BF377F: Refreshing state... [id=Z02291682TYZCXB0OVCLA]
data.aws_kms_alias.shared-snowplow-consumer-app_application_pocket_vpc_secrets_manager_key_901EECFD: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
aws_codedeploy_app.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_ecs_code_deploy_8FE8F303: Refreshing state... [id=9ff5c54a-e020-47ac-8f5f-78453eab66d3:SharedSnowplowConsumer-Dev-ECS]
data.aws_ssm_parameter.shared-snowplow-consumer-app_application_pocket_vpc_private_subnets_3023DDDD: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_route53_zone.shared-snowplow-consumer-app_application_base_dns_main_hosted_zone_EA88CD39: Reading...
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:410318598490:Backend-Dev-ChatBot]
aws_ecr_repository.shared-snowplow-consumer-app_application_ecs_service_ecr-app_ecr-repo_C47DCC29: Refreshing state... [id=sharedsnowplowconsumer-dev-app]
data.terraform_remote_state.incident_management: Read complete after 1s
data.aws_region.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_current_region_46D68E2A: Reading...
data.aws_region.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_current_region_46D68E2A: Read complete after 0s [id=us-east-1]
aws_sqs_queue.sns-topic-dlq: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/SharedSnowplowConsumer-Dev-SNS-Topics-DLQ]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:SharedSnowplowConsumer-Dev-Infrastructure-Alarm-Critical]
data.aws_caller_identity.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_current_account_388FE51A: Reading...
data.aws_ssm_parameter.shared-snowplow-consumer-app_application_pocket_vpc_public_subnets_7BC49E7E: Reading...
data.aws_caller_identity.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_current_account_388FE51A: Read complete after 0s [id=410318598490]
aws_sqs_queue.shared-event-consumer: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/SharedSnowplowConsumer-Dev-SharedEventConsumer-Queue]
data.aws_region.region: Reading...
data.aws_caller_identity.shared-snowplow-consumer-app_application_pocket_vpc_current_identity_AAE4891A: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.shared-snowplow-consumer-app_application_pocket_vpc_public_subnets_7BC49E7E: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_ssm_parameter.shared-snowplow-consumer-app_application_pocket_vpc_vpc_ssm_param_7FC9719C: Reading...
data.aws_caller_identity.shared-snowplow-consumer-app_application_pocket_vpc_current_identity_AAE4891A: Read complete after 0s [id=410318598490]
data.aws_kms_alias.kms_alias: Reading...
aws_cloudwatch_log_group.shared-snowplow-consumer-app_app-log-group_3D66A20E: Refreshing state... [id=/Backend/SharedSnowplowConsumer-Dev/ecs/app]
data.aws_caller_identity.caller: Reading...
data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_codedeploy_assume_role_CB3573F8: Reading...
data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_codedeploy_assume_role_CB3573F8: Read complete after 0s [id=4250039221]
aws_codestarnotifications_notification_rule.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_67DBFB5C: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/010c2a0649d938a17df64eed15aae3b1c4c28b57]
data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-assume_898B3E93: Reading...
data.aws_caller_identity.caller: Read complete after 0s [id=410318598490]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-assume_898B3E93: Read complete after 0s [id=1077804475]
data.aws_ssm_parameter.shared-snowplow-consumer-app_application_pocket_vpc_vpc_ssm_param_7FC9719C: Read complete after 0s [id=/Shared/Vpc]
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_route53_zone.shared-snowplow-consumer-app_application_base_dns_main_hosted_zone_EA88CD39: Read complete after 1s [id=ZCSIDA846KWLN]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PG8VEMH]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
aws_iam_role.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_9A411340: Refreshing state... [id=SharedSnowplowConsumer-Dev-ECSCodeDeployRole]
aws_cloudwatch_metric_alarm.sharedsnowplowconsumer-dev-dlq-alarm: Refreshing state... [id=SharedSnowplowConsumer-Dev-SharedSnowplowConsumer-Dev-Dlq-Alarm]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PJHGFC7]
aws_route53_record.shared-snowplow-consumer-app_application_alb_certificate_certificate_record_FA5168A0: Refreshing state... [id=Z02291682TYZCXB0OVCLA__6ac4066a1e6eebd486752a7c18b6d544.shared-snowplow-consumer.getpocket.dev._CNAME]
data.aws_iam_policy_document.shared-snowplow-consumer-sns-dlq-policy-document: Reading...
aws_iam_role.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-role_6BFBDB3C: Refreshing state... [id=SharedSnowplowConsumer-Dev-TaskRole]
data.aws_iam_policy_document.shared-snowplow-consumer-sns-dlq-policy-document: Read complete after 0s [id=2154816519]
data.aws_vpc.shared-snowplow-consumer-app_application_pocket_vpc_669183F3: Reading...
aws_route53_record.shared-snowplow-consumer-app_application_base_dns_subhosted_zone_ns_A5A92F9C: Refreshing state... [id=ZCSIDA846KWLN_shared-snowplow-consumer.getpocket.dev_NS]
aws_iam_role.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-execution-role_CD87AD67: Refreshing state... [id=SharedSnowplowConsumer-Dev-TaskExecutionRole]
data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_FB68591B: Reading...
data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_FB68591B: Read complete after 0s [id=1727204555]
aws_ecr_lifecycle_policy.shared-snowplow-consumer-app_application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_5A709DFD: Refreshing state... [id=sharedsnowplowconsumer-dev-app]
aws_sns_topic_subscription.ShareableListEventTopic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ShareableListEventTopic:a320ad71-43d4-4836-b1f2-23a6dc875a51]
aws_sns_topic_subscription.ProspectEventTopic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ProspectEventTopic:96fb7a15-f5d3-49ee-8e79-4a3ac40592d2]
aws_sns_topic_subscription.CollectionEventTopic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-CollectionEventTopic:be1d7c8c-6117-44f5-ac8f-496c2d02f911]
data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_data-ecs-task-role-policy_0662E1E4: Reading...
data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_data-ecs-task-role-policy_0662E1E4: Read complete after 0s [id=117179350]
data.aws_iam_policy_document.shared-snowplow-consumer-sns-sqs-policy-document: Reading...
data.aws_iam_policy_document.shared-snowplow-consumer-sns-sqs-policy-document: Read complete after 0s [id=2911155291]
aws_sns_topic_subscription.UserEventTopic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserEventTopic:9bd67f42-b40e-420f-b421-89280368bf5d]
aws_sns_topic_subscription.ShareableListItemEventTopic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ShareableListItemEventTopic:6ef9d87c-3e3c-4a0e-b1d3-2f5a1fac9e69]
aws_sqs_queue_policy.shared-snowplow-consumer-sns-dlq-policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/SharedSnowplowConsumer-Dev-SNS-Topics-DLQ]
aws_acm_certificate_validation.shared-snowplow-consumer-app_application_alb_certificate_certificate_validation_0A8F4C89: Refreshing state... [id=2023-07-20 19:28:11.673 +0000 UTC]
aws_iam_policy.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-execution-role-policy_A2B67C8A: Refreshing state... [id=arn:aws:iam::410318598490:policy/SharedSnowplowConsumer-Dev-TaskExecutionRolePolicy]
aws_iam_role_policy_attachment.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_740EA775: Refreshing state... [id=SharedSnowplowConsumer-Dev-ECSCodeDeployRole-20230720194352010300000001]
aws_iam_policy.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-role-policy_10D31114: Refreshing state... [id=arn:aws:iam::410318598490:policy/SharedSnowplowConsumer-Dev-TaskRolePolicy]
aws_sqs_queue_policy.shared-snowplow-consumer-sns-sqs-policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/SharedSnowplowConsumer-Dev-SharedEventConsumer-Queue]
aws_iam_role_policy_attachment.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_D76A238C: Refreshing state... [id=SharedSnowplowConsumer-Dev-TaskExecutionRole-20230720194352088700000003]
aws_ecs_task_definition.shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B: Refreshing state... [id=SharedSnowplowConsumer-Dev]
aws_iam_role_policy_attachment.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_6610BEED: Refreshing state... [id=SharedSnowplowConsumer-Dev-TaskExecutionRole-20230720194352063900000002]
aws_iam_role_policy_attachment.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-custom-attachment_0CF1CAB2: Refreshing state... [id=SharedSnowplowConsumer-Dev-TaskRole-20230720194459799900000004]
local_file.shared-snowplow-consumer-app_application_ecs_service_appspec_7674CFF9: Refreshing state... [id=053d88e373db7ca5e9e30feb6991bdddad69e7d9]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 0s [id=PKAPG94]
data.aws_vpc.shared-snowplow-consumer-app_application_pocket_vpc_669183F3: Read complete after 0s [id=vpc-012481e83ffa5e152]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=P27QJ5S]
aws_alb_target_group.shared-snowplow-consumer-app_application_ecs_service_green_target_group_ecs_target_group_BFDC5A80: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/SSPCgr20230720192713239300000002/1557825f2c7f76ce]
data.aws_security_groups.shared-snowplow-consumer-app_application_pocket_vpc_default_security_groups_B7959268: Reading...
data.aws_security_groups.shared-snowplow-consumer-app_application_pocket_vpc_internal_security_groups_B160376D: Reading...
data.aws_subnets.shared-snowplow-consumer-app_application_pocket_vpc_private_subnet_ids_2E64E66B: Reading...
data.aws_subnets.shared-snowplow-consumer-app_application_pocket_vpc_public_subnet_ids_0F6380BA: Reading...
aws_security_group.shared-snowplow-consumer-app_application_application_load_balancer_alb_security_group_0793B1C8: Refreshing state... [id=sg-0c49ada7dfc840d0d]
aws_alb_target_group.shared-snowplow-consumer-app_application_ecs_service_blue_target_group_ecs_target_group_13867750: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/SSPCbl20230720192627332800000001/e9aba7bf34b493fe]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 0s [id=PZQ6AUS]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=P9SMKX5]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=P5GBJHF]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=PQ2NL9V]
data.aws_security_groups.shared-snowplow-consumer-app_application_pocket_vpc_internal_security_groups_B160376D: Read complete after 0s [id=us-east-1]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:SharedSnowplowConsumer-Dev-Infrastructure-Alarm-Non-Critical:e8bc9eba-69fb-4a14-937f-20df4987b3ae]
data.aws_security_groups.shared-snowplow-consumer-app_application_pocket_vpc_default_security_groups_B7959268: Read complete after 0s [id=us-east-1]
data.aws_subnets.shared-snowplow-consumer-app_application_pocket_vpc_private_subnet_ids_2E64E66B: Read complete after 0s [id=us-east-1]
data.aws_subnets.shared-snowplow-consumer-app_application_pocket_vpc_public_subnet_ids_0F6380BA: Read complete after 0s [id=us-east-1]
aws_alb.shared-snowplow-consumer-app_application_application_load_balancer_alb_FFECA3E0: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:loadbalancer/app/SSPC20230720192721055200000008/39a0f31086f5de5f]
aws_security_group.shared-snowplow-consumer-app_application_ecs_service_ecs_security_group_7774AE75: Refreshing state... [id=sg-0534be73c47c4b242]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:SharedSnowplowConsumer-Dev-Infrastructure-Alarm-Critical:ca98cb47-102e-4af7-aa67-95081b8e7778]
aws_route53_record.shared-snowplow-consumer-app_application_alb_record_9558B043: Refreshing state... [id=Z02291682TYZCXB0OVCLA_shared-snowplow-consumer.getpocket.dev_A_1]
aws_cloudwatch_metric_alarm.shared-snowplow-consumer-app_application_alarm-httptarget5xxerrorrate_802C465E: Refreshing state... [id=SharedSnowplowConsumer-Dev-Alarm-HTTPTarget5xxErrorRate]
aws_alb_listener.shared-snowplow-consumer-app_application_listener_http_78D658C8: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/SSPC20230720192721055200000008/39a0f31086f5de5f/3722af5cf55d6fcf]
aws_alb_listener.shared-snowplow-consumer-app_application_listener_https_D2F12616: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/SSPC20230720192721055200000008/39a0f31086f5de5f/00a83b68dba1fbeb]
aws_alb_listener_rule.shared-snowplow-consumer-app_application_ecs_service_listener_rule_42D25C4D: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener-rule/app/SSPC20230720192721055200000008/39a0f31086f5de5f/00a83b68dba1fbeb/e01f5d59c25b9d19]
aws_ecs_service.shared-snowplow-consumer-app_application_ecs_service_ecs-service_4DE3767A: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:service/SharedSnowplowConsumer-Dev/SharedSnowplowConsumer-Dev]
aws_cloudwatch_dashboard.shared-snowplow-consumer-app_application_cloudwatch-dashboard_8DFBB8D3: Refreshing state... [id=SharedSnowplowConsumer-Dev]
aws_appautoscaling_target.shared-snowplow-consumer-app_application_autoscaling_autoscaling_target_E0F1D1EF: Refreshing state... [id=service/SharedSnowplowConsumer-Dev/SharedSnowplowConsumer-Dev]
aws_codedeploy_deployment_group.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_6E78E722: Refreshing state... [id=51db535f-ffb1-4511-84f1-54a41d77a98b]
aws_appautoscaling_policy.shared-snowplow-consumer-app_application_autoscaling_scale_out_policy_43437361: Refreshing state... [id=SharedSnowplowConsumer-Dev-ScaleOutPolicy]
aws_appautoscaling_policy.shared-snowplow-consumer-app_application_autoscaling_scale_in_policy_5FED7B33: Refreshing state... [id=SharedSnowplowConsumer-Dev-ScaleInPolicy]
aws_cloudwatch_metric_alarm.shared-snowplow-consumer-app_application_autoscaling_scale_in_alarm_A2935CCC: Refreshing state... [id=SharedSnowplowConsumer-Dev Service Low CPU]
aws_cloudwatch_metric_alarm.shared-snowplow-consumer-app_application_autoscaling_scale_out_alarm_EFA0BDC3: Refreshing state... [id=SharedSnowplowConsumer-Dev Service High CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B must be replaced
-/+ resource "aws_ecs_task_definition" "shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B" {
      ~ arn                      = "arn:aws:ecs:us-east-1:410318598490:task-definition/SharedSnowplowConsumer-Dev:123" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:410318598490:task-definition/SharedSnowplowConsumer-Dev" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "410318598490.dkr.ecr.us-east-1.amazonaws.com/sharedsnowplowconsumer-dev-app:11b559de706da7a08d35e736b1449859d82053e4" -> "410318598490.dkr.ecr.us-east-1.amazonaws.com/sharedsnowplowconsumer-dev-app:a7dc4f1187db3321c04c85cb88bb7f38acb8a67b"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls         = []
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls         = []
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "SharedSnowplowConsumer-Dev" -> (known after apply)
      ~ revision                 = 123 -> (known after apply)
        tags                     = {
            "environment" = "Dev"
            "service"     = "SharedSnowplowConsumer"
        }
        # (10 unchanged attributes hidden)
    }

  # local_file.shared-snowplow-consumer-app_application_ecs_service_appspec_7674CFF9 will be created
  + resource "local_file" "shared-snowplow-consumer-app_application_ecs_service_appspec_7674CFF9" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
aws_ecs_task_definition.shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B: Destroying... [id=SharedSnowplowConsumer-Dev]
aws_ecs_task_definition.shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B: Destruction complete after 0s
aws_ecs_task_definition.shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B: Creating...
aws_ecs_task_definition.shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B: Creation complete after 1s [id=SharedSnowplowConsumer-Dev]
local_file.shared-snowplow-consumer-app_application_ecs_service_appspec_7674CFF9: Creating...
local_file.shared-snowplow-consumer-app_application_ecs_service_appspec_7674CFF9: Creation complete after 0s [id=40bcaa8decc2b29ae8271a8bee9a500e45674b51]

Apply complete! Resources: 2 added, 0 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"e11ec972-a448-44b1-9c71-4092176a2183","JobName":"shared-snowplow-consumer_infrastructure_apply_dev","PRNumber":249,"Program":"tfcmt","SHA1":"a7dc4f1187db3321c04c85cb88bb7f38acb8a67b","Target":"shared-snowplow-consumer-cdk-dev","Vars":{}} -->